cases/supersonicEjector/rCF/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0.01";
    object          p;
}

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    axis
    {
        type            empty;
    }
    inletMain
    {
        type            uniformTotalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              table ((0 100000) (0.0001 700000));
        value           uniform 1e5;
    }
    outlet
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        100000;
        lInf            1;
        value           uniform 1e5;
    }
    inletSecondary
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 100000;
        value           uniform 1e5; 
    }
    wallNozzle1
    {
        type            zeroGradient;
    }
    wallInletSecondary
    {
        type            zeroGradient;
    }
    wallDiffuser
    {
        type            zeroGradient;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
